Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: Updated the Strings and Characters chapter, now that String no longer conforms to the CollectionType protocol from the Swift standard library.
ja: 節文字列と文字を更新した、現在ではStringはもはやスウィフト標準ライブラリ由来のCollectionTypeプロトコルに準拠しません。

source: Updated the Subscript Options section, now that subscripts support parameters with default values.
ja: 添え字オプションの節を更新した、今では添え字は省略時の値をもつパラメータをサポートします。

source: Updated the Type Annotations section to note that multiple related variables can be defined on a single line with one type annotation.
ja: 型注釈の節を更新して複数の関連する変数が１行だけで１つの型注釈で定義されることが出来ることを記しました。

source: Updated the Type Attributes section with information about the @convention attribute.
ja: 節型属性を@convention属性についての情報で更新した。

source: Updated the Type Properties section with information about stored and computed type properties for classes, structures, and enumerations.
ja: 節型プロパティをクラス、構造体、そして列挙のための格納および計算型プロパティについての情報で更新した。

source: Updated the Variadic Parameters section, now that variadic parameters can be declared in any position in a function’s parameter list.
ja: 可変長パラメータ節を更新した、現在では可変長パラメータは関数のパラメータリストの中のあらゆる位置で宣言されることができます。

source: Updated the Operators reference to describe the revised rules.
ja: 改められた規則を記述するために演算子リファレンスを更新しました。

source: Updated the definition of Unicode scalars in string literals.
ja: 文字列リテラルの中のユニコードスカラーの定義を新しくしました。

source: Updated the discussion about default parameters in the Default Parameter Values section, now that they can’t be reordered in function calls.
ja: 省略時のパラメータについての議論を省略時のパラメータ値の節で更新した、今ではそれらは関数呼び出しにおいて再配列されることが出来ないので。

source: Updated the discussion in Functions that Never Return to use the new Never type.
ja: 決して返らない関数での議論を更新して新しいNever型を使うようにした。

source: Updated the discussion in the Escaping Closures section, now that closures are nonescaping by default.
ja: クロージャを脱出するの節において議論を更新した、今ではクロージャは初期状態で非脱出です。

source: Updated the discussion in the Function Type section to note that argument labels are not allowed when writing a function type.
ja: 関数型節での議論を更新して、属性ラベルは関数型を書いている時に許可されないことを注記した。

source: Updated the discussion in the Function Type section, now that Swift distinguishes between functions that take multiple parameters and functions that take a single parameter of a tuple type.
ja: 関数型の節での議論を更新した、今ではスウィフトは複数のパラメータを取る関数とただ１つのタプル型のパラメータを取る関数の間の区別をするので。

source: Updated the discussion in the Generic Where Clauses section of the Generics chapter and in the Generic Parameters and Arguments chapter, now that generic where clauses are written at the end of a declaration.
ja: 総称体where節の節で総称体の章において、そして総称体パラメータと引数の章においてその議論を更新した、今では総称体where節は宣言の最後に書かれます。

source: Updated the discussion in the In-Out Parameters section to note that only nonescaping closures can capture in-out parameters.
ja: in-outパラメータの節において解説を更新して、非脱出クロージャのみがin-outパラメータをキャプチャできることを注記した。

source: Updated the discussion in the Optional Binding section of the The Basics chapter and the While Statement section of the Statements chapter, now that if, while, and guard statements use a comma-separated list of conditions without where clauses.
ja: オプショナルを束縛するの節を基本の章で、そしてwhile文の節を文の章でその議論を更新した、今ではif、while、そしてguard文はコンマで区切られた条件リストをwhere節なしで使うからです。

source: Updated the discussion in the Protocol Composition section of the Protocols chapter, and in the Protocol Composition Type section of the Types chapter, now that protocol composition types can contain a superclass requirement.
ja: 議論をプロトコル合成の節でプロトコルの章において、そしてプロトコル合成型の節で型の章において更新した、今ではプロトコル合成型はスーパークラス要件を含むことができます。

source: Updated the discussion in the Dynamic Type Expression section to use the new type(of:) syntax for dynamic type expressions.
ja: 「動的型式」の節において議論を更新して、 新しいtype(of:)構文を動的型式に使うようにした。

source: Updated the discussion of inout in the Function Declaration section to note that it appears in front of a parameter’s type instead of in front of a parameter’s name.
ja: inoutの議論を関数宣言の節において更新して、それが現れるのはパラメータの持つ型の前で、パラメータの名前の前でないことを注記した。

source: Updated the discussion of Swift language version numbers in the Conditional Compilation Block section, now that an optional patch number is allowed.
ja: スウィフト言語バージョン番号の議論を条件比較ブロックの節において更新した、今では随意のパッチ番号が許可されます。

source: Updated the discussion of associated types to use the associatedtype keyword in the Associated Types and Protocol Associated Type Declaration sections.
ja: 関連型の議論をassociatedtypeキーワードを使うように関連型とプロトコル関連型宣言の節で更新した。

source: Updated the discussion of function types in the Function Type section now that function argument labels are no longer part of a function’s type.
ja: 関数型の解説を節関数型において更新した、今では関数引数ラベルはもはや関数の型の一部ではありません。

source: Updated the discussion of function types in the Function Type section to note that parentheses around the parameter types are required.
ja: 関数型の解説を節関数型において更新して、パラメータ型の周りの丸括弧は必要とされることを注記した。

source: Updated the discussion of functions in the Functions chapter and the Function Declaration section to note that all parameters get an argument label by default.
ja: 関数の解説を関数の章と関数宣言の節において更新して、すべてのパラメータが引数ラベルを初期状態で受け取ることを注記した。

source: Updated the discussion of line control statements to use the #sourceLocation(file:line:) syntax in the Line Control Statement section.
ja: 行制御文の解説を#sourceLocation(file:line:)構文を使うように行制御文の節において更新した。

source: Updated the discussion of operators in the Advanced Operators chapter, now that you implement them as type methods instead of as global functions.
ja: 演算子の議論を先進の演算子の章において更新した、今ではあなたはそれらをグローバル関数としてではなく型メソッドとして実装するからです。

source: Updated the discussion of optional protocol requirements in the Optional Protocol Requirements section to clarify that they are used only in code that interoperates with Objective-C.
ja: オプショナルプロトコル要件の解説を節オプショナルのプロトコル要件において更新して、それらがObjective-Cと相互運用するコードにおいてのみ使用されることを明確にした。

source: Updated the discussion of protocol composition types in the Protocol Composition section of the Protocols chapter and in the Protocol Composition Type section of the Types chapter to use the new Protocol1 & Protocol2 syntax.
ja: プロトコル合成型の議論をプロトコル合成の節でプロトコルの章において、そしてプロトコル合成型の節で型の章において更新して、新しいProtocol1 & Protocol2構文を使うようにした。

source: Updated the discussion of protocol extensions in Extension Declaration now that final isn’t allowed in them.
ja: プロトコル拡張の議論を拡張宣言において更新した、今ではfinalはそれらにおいて許可されません。

source: Updated the discussion of the @NSManaged attribute in the Declaration Attributes section, now that the attribute can be applied to certain instance methods.
ja: @NSManaged属性の議論を宣言属性節において更新した、現在ではこの属性は特定のインスタンスメソッドに適用されることができます。

source: Updated the discussion of the @noescape and @autoclosure attributes in the Escaping Closures and Autoclosures sections and the Attributes chapter now that they are type attributes, rather than declaration attributes.
ja: @noescapeと@autoclosure属性の議論を脱出クロージャと自動クロージャの節および属性の章で更新した、今ではそれらは型属性です、宣言属性ではなくて。

source: Updated the discussion of the @objc attribute in the Declaration Attributes section to note that enumerations and enumeration cases can use this attribute.
ja: @objc属性についての議論を宣言属性において更新して、列挙と列挙ケースがこの属性を使用できることを注記した。

source: Updated the discussion of the objc attribute in Declaration Attributes, now that this attribute is inferred in fewer places.
ja: objc属性の議論を宣言属性において更新した、現在この属性はいくつかの場所で推論されます。

source: Updated the discussion of weak and unowned references in the Automatic Reference Counting chapter.
ja: 弱いそして非所有参照の議論を自動参照カウントの章において更新した。

source: Updated the entire book to refer to ..< as the Half-Open Range Operator (rather than the “half-closed range operator”).
ja: ..<を半開範囲演算子と言うように本全体を更新しました（「半完結範囲演算子」ではなしに）。

source: Updated the example in Type Casting for Any and AnyObject to show how to check for and cast to a function type within a switch statement.
ja: AnyおよびAnyObjectに対する型キャストでの例を更新して、switch文内のある関数型について調べてキャストする方法を示しました。

source: Updated the information about Memberwise Initializers for Structure Types to clarify that the memberwise structure initializer is made available even if a structure’s stored properties do not have default values.
ja: 構造体型のためのメンバー関連イニシャライザについての情報が更新されて、メンバー関連の構造体初期化子が、ある構造体の持つ格納プロパティが省略時の値を持たなくてさえも、利用可能にされることをわかりやすくされました。

source: Updated the information about Mutability of Collections and Arrays to reflect the new approach.
ja: 新しい取り組み方を反映するために、コレクションの可変性および配列についての情報が更新されます。

source: Updated the rules for constant and constant property declaration and initialization.
ja: 定数と定数プロパティの宣言と初期化についての規則を新しくしました。

source: Updated to ..< rather than .. for the Half-Open Range Operator.
ja: 半開範囲演算子に対して..ではなく..<に更新しました。

source: Updating the budget is a two-step process: First you add the items’ names and prices, and then you change the total amount to reflect the items currently on the list.
ja: 予算案の更新は２段階の処理です：最初にあなたはその項目の名前と値段を加えます、それからあなたは総支出額を変更してそれら項目の現在をリスト上に反映します。

source: Upper- or lowercase letter A through Z
ja: 大文字または小文字のAからZ

source: Use ..< to make a range that omits its upper value, and use ... to make a range that includes both values.
ja: ..<をその上側の値を除く範囲を作るために使ってください、そして...を両方の値を含む範囲を作るために使ってください。

source: Use Any and AnyObject only when you explicitly need the behavior and capabilities they provide.
ja: あなたが明白にそれらが提供する挙動と能力を必要とする時にだけ、AnyとAnyObjectを使ってください。

source: Use UInt only when you specifically need an unsigned integer type with the same size as the platform’s native word size.
ja: あなたが特にプラットホーム固有のワードサイズと同じ大きさで符号なし整数型を必要とする時にだけUIntを使ってください。

source: Use \() to include a floating-point calculation in a string and to include someone’s name in a greeting.
ja: \()を、浮動小数点計算を文字列に含めるために、そして誰かの名前をある挨拶に含めるために使ってみてください。

source: Use class followed by the class’s name to create a class.
ja: あるクラスを作成するためにclassを使ってその後にそのクラスの名前を続けてください。

source: Use defer to write a block of code that is executed after all other code in the function, just before the function returns.
ja: deferを使って関数の中の全ての他のコードの後で、その関数が返る直前に実行されるひとかたまりのコードを書いてください。

source: Use deinit to create a deinitializer if you need to perform some cleanup before the object is deallocated.
ja: オブジェクトが割り当て解除される前にあなたがいくらかの掃除をする必要があるならば、デイニシャライザをつくるために、deinitを使ってください。

source: Use enum to create an enumeration.
ja: 列挙をつくるために、enumを使ってください。

source: Use extension to add functionality to an existing type, such as new methods and computed properties.
ja: 機能性、例えば新しいメソッドや計算プロパティなどを、既存の型に加えるために、extensionを使ってください。

source: Use fileprivate(set), private(set), and internal(set) to change the access level of this synthesized setter in exactly the same way as for an explicit setter in a computed property.
ja: fileprivate(set)、private(set)、そしてinternal(set)を使って、計算プロパティにおける明示的なセッターと正確に同じ方法で、この総合されたセッターのアクセス水準を変更してください。

source: Use func to declare a function.
ja: funcを使うことで、あるひとつの関数を宣言してください。

source: Use iOS, macOS, watchOS, and tvOS for the platform names, and include the corresponding version numbers.
ja: プラットホーム名としてiOS、macOS、watchOS、そしてtvOSを、付随するバージョン番号を含めて使ってください。

source: Use if and switch to make conditionals, and use for-in, while, and repeat-while to make loops.
ja: 条件文を作るためにifとswitchを使ってください、そしてループを作るためにfor-in、while、そしてrepeat-whileを使ってください。

source: Use let to make a constant and var to make a variable.
ja: letを使って定数を作りvarを使って変数を作ってください。

source: Use protocol to declare a protocol.
ja: あるプロトコルを宣言するために、protocolを使ってください。

source: Use struct to create a structure.
ja: 構造体を作成するために、structを使ってください。

source: Use throw to throw an error and throws to mark a function that can throw an error.
ja: あるエラーをスローする（投げかける）ためにthrowを、そしてエラーをスローできる関数に印をつけるためにthrowsを使ってください。

source: Use where right before the body to specify a list of requirements—for example, to require the type to implement a protocol, to require two types to be the same, or to require a class to have a particular superclass.
ja: 本文のまさに前に、必要なことのリストを指定するためにwhereを使ってください ― 例えば、型があるプロトコルを実装することを要求するために、２つの型が同じものであることを要求するために、またはあるクラスがある特定のスーパークラスを持つことを要求するために。

source: Use while to repeat a block of code until a condition changes.
ja: whileを使って、コードのひとかたまり（ブロック）を、ある条件が変化するまで繰り返します。

source: Use -> to separate the parameter names and types from the function’s return type.
ja: ->を使って、パラメーター名とその関数の返す型とを隔ててください。

source: Use in to separate the arguments and return type from the body.
ja: inを使って、引数および返す型を本文から切り離してください。

source: Use init to create one.
ja: そうしたものをつくるために、initを使ってください。

source: Use a class-only protocol when the behavior defined by that protocol’s requirements assumes or requires that a conforming type has reference semantics rather than value semantics.
ja: クラス専用プロトコルを、そのプロトコルの要件によって定義される挙動が想定されるまたは必要とされる時、準拠する型が値意味論ではなく参照意味論を持つ時に、使ってください。

source: Use a line control statement to change the source code location used by Swift for diagnostic and debugging purposes.
ja: 行制御文を使ってスウィフトによって使われるソースコード位置を診断上のそしてデバッグの目的で変更してください。

source: Use a new key of the appropriate type as the subscript index, and assign a new value of the appropriate type:
ja: 添え字インデックスとして適切な型の新しいキーを使ってください、そして適切な型の新しい値を割り当ててください：

source: Use a precondition whenever a condition has the potential to be false, but must definitely be true for your code to continue execution.
ja: ある条件が偽である可能性をもつ、しかしdefinitelyがあなたのコードの実行の継続のためにtrueでなければならない時はいつでも前提条件を使ってください。

source: Use a single break statement if you don’t intend to execute any code in the body of a matched case.
ja: あなたがマッチされたケース節の本文において何らコードを実行するつもりでないならば、ただ１つbreak文を使ってください。

source: Use a string literal as an initial value for a constant or variable:
ja: 文字列リテラルを定数または変数の初期値として使ってください：

source: Use a tuple to make a compound value—for example, to return multiple values from a function.
ja: ある混成の値を作るために、タプル（一組にしたもの）を使ってください ― 例えば、関数から複数の値を返すために。

source: Use a weak reference when the other instance has a shorter lifetime—that is, when the other instance can be deallocated first.
ja: 弱い参照を他のインスタンスがより短い生涯を持つ場合に使ってください — すなわち、他のインスタンスが最初にでアロケートされることが可能である時。

source: Use a wildcard pattern when you don’t care about the values being matched against.
ja: あなたがマッチされている値を気にかけない場合に、ワイルドカード・パターンを使ってください。

source: Use an initializer expression to construct an instance of a type from that type’s metatype value.
ja: イニシャライザ式を使って、ある型のインスタンスをその型のメタタイプ値から組み立ててください。

source: Use an unowned reference only when you are sure that the reference always refers to an instance that has not been deallocated.
ja: 非所有参照を、その参照が常にデアロケートされていないインスタンスに言及するとあなたが確信する時にだけ使用してください。

source: Use comments to include nonexecutable text in your code, as a note or reminder to yourself.
ja: あなた自身への注意事項または覚え書きとして、実行可能でないテキストをあなたのコードに含めるために、コメントを使ってください。

source: Use dot syntax to access the properties and methods of the instance.
ja: そのインスタンスのプロパティおよびメソッドにアクセスするためにドット構文を使用してください。

source: Use file-private access to hide the implementation details of a specific piece of functionality when those details are used within an entire file.
ja: それら詳細があるファイル全体の内部で使われる時に、機能性のある特定部分のそれら実装詳細を隠すために、ファイル外非公開アクセスを使ってください。

source: Use optional chaining to conditionally perform an operation on an implicitly unwrapped optional expression.
ja: ある暗黙的にアンラップされるオプショナルの式に関して演算を条件付きで実行するために、オプショナル連鎖を使ってください。

source: Use other integer types only when they’re specifically needed for the task at hand, because of explicitly sized data from an external source, or for performance, memory usage, or other necessary optimization.
ja: 外部ソース由来の明確に大きさを設定されたデータのために、またはパフォーマンス、メモリ使用、または他の必要な最適化のためになど、目下の作業に特に必要とされる時にだけ、他の整数を使ってください。

source: Use private access to hide the implementation details of a specific piece of functionality when those details are used only within a single declaration.
ja: それら詳細がある単一の宣言内部でのみ使われる時に、機能性のある特定部分のそれら実装詳細を隠すために、非公開アクセスを使ってください。

source: Use statement labels with break and continue statements to be explicit about how you want to change control flow in a loop statement or a switch statement, as discussed in Break Statement and Continue Statement below.
ja: breakとcontinue文で文ラベルを使って、あなたがループ文またはswitch文においてどのように制御の流れを変えたいかについて明示してください、下記のブレーク文と継続文で議論されるように。

source: Use the Int type for all general-purpose integer constants and variables in your code, even if they’re known to be nonnegative.
ja: Int型を全ての一般的な目的のための整数の定数と変数に対してあなたのコードにおいて使ってください、たとえそれらが負数でないことが知られているとしてもです。

source: Use the indices property to access all of the indices of individual characters in a string.
ja: indicesプロパティを使って、ある文字列中の個々の文字のインデックスの全てにアクセスしてください。

source: Use the init?(rawValue:) initializer to make an instance of an enumeration from a raw value.
ja: init?(rawValue:)イニシャライザを使用して、生の値から列挙のインスタンスを作ってください。

source: Use the intersection(_:) method to create a new set with only the values common to both sets.
ja: intersection(_:)メソッドを使って両方の集合に共通した値だけを持つ新しい集合を作成してください。

source: Use the isDisjoint(with:) method to determine whether two sets have no values in common.
ja: isDisjoint(with:)メソッドを使って２つの集合が共通の値を全く持たないかどうか判定してください。

source: Use the isStrictSubset(of:) or isStrictSuperset(of:) methods to determine whether a set is a subset or superset, but not equal to, a specified set.
ja: isStrictSubset(of:)またはisStrictSuperset(of:)メソッドを使ってある集合がある指定した集合の下位集合または上位集合、しかし等しくはない、かどうか決定してください。

source: Use the isSubset(of:) method to determine whether all of the values of a set are contained in the specified set.
ja: isSubset(of:)メソッドを使ってある集合のすべての値が指定した集合の値の中に含まれるかどうか決定してください。

source: Use the isSuperset(of:) method to determine whether a set contains all of the values in a specified set.
ja: isSuperset(of:)メソッドを使ってある集合がある指定した集合の値のすべてを含むかどうか決定してください。

source: Use the startIndex property to access the position of the first Character of a String.
ja: あるStringの最初のCharacterの位置にアクセスするためにstartIndexプロパティを使ってください。

source: Use the subtracting(_:) method to create a new set with values not in the specified set.
ja: subtracting(_:)メソッドを使って指定した集合にない値を持つ新しい集合を作成してください。

source: Use the symmetricDifference(_:) method to create a new set with values in either set, but not both.
ja: symmetricDifference(_:)メソッドを使ってどちらかの集合にある、しかし両方にではない値を持つ新しい集合を作成してください。

source: Use the union(_:) method to create a new set with all of the values in both sets.
ja: union(_:)メソッドを使って両方の集合のすべての値を持つ新しい集合を作成してください。

source: Use the String type’s append(_:) method to append a single Character value onto the end of a string.
ja: String型のappend(_:)メソッドを単一のCharacter値を文字列の終わりに加えるために使ってください。

source: Use the stride(from:to:by:) function to skip the unwanted marks.
ja: stride(from:to:by:)関数を使って、不必要な印を飛ばしてください。

source: Use the rawValue property to access the raw value of an enumeration case.
ja: rawValueプロパティを使用して、列挙ケース節の生の値にアクセスしてください。

source: Use the type check operator (is) to check whether an instance is of a certain subclass type.
ja: 型確認演算子（is）を使用して、あるインスタンスが特定のサブクラス型であるかどうか調べてください。

source: Use the Boolean isEmpty property as a shortcut for checking whether the count property is equal to 0:
ja: ブールのisEmptyプロパティをcountプロパティが0と等しいかどうかを調べる近道として使ってください：

source: Use the classes defined above to create a new Person instance, and try to access its numberOfRooms property as before:
ja: 上のクラス定義を使って、新しいPersonインスタンスをつくって、前のようにそのnumberOfRoomsプロパティにアクセスすることを試みてください：

source: Use the conditional form of the type cast operator (as?) when you are not sure if the downcast will succeed.
ja: あなたがダウンキャストが成功するかどうかよくわからない場合には、条件形式の型キャスト演算子（as?）を使ってください。

source: Use the forced form of the type cast operator (as!) only when you are sure that the downcast will always succeed.
ja: あなたがダウンキャストが常に成功すると確信する場合には、強制形式の型キャスト演算子（as!）を使います。

source: Use the half-open range operator (..<) to include the lower bound but not the upper bound.
ja: 半開範囲演算子（..<）を使って、下方の境界を含めて、しかし上方の境界を含めないようにしてください。

source: Use the ternary conditional operator with care, however.
ja: しかし、注意して三項条件演算子を使用してください。

source: Use the “is equal” operator (==) to determine whether two sets contain all of the same values.
ja: 「同等」演算子（==）を使って２つの集合がすべて同じ値を含むかどうか決定してください。

source: Use these operators to check whether two constants or variables refer to the same single instance:
ja: ２つの定数または変数が同じ１つのインスタンスに言及するかどうか調べるためにこれらの演算子を使用してください：

source: Use this approach if you need to add a potential failure state to an existing initialization process that does not otherwise fail.
ja: あなたが、起こりうる失敗状況を、その場合にも失敗しない既存の初期化プロセスに加える必要がある場合に、このやり方を使ってください。

source: Use this attribute to help discourage ambiguity between functions with the same name that are accessible from the same scope.
ja: この属性を使って、関数とその同じスコープからアクセス可能な同じ名前との間の曖昧さを防止するのに役立ててください。

source: Use this form of an access-level modifier when you want to specify an access level for the setter of a variable or subscript that’s less than or equal to the access level of the variable or subscript itself, as discussed in Getters and Setters.
ja: アクセス水準修飾子のこの形式は、あなたが変数または添え字のセッターにその変数または添え字それ自身のアクセス水準よりもより少ないか等しいアクセス水準を指定することを望むときに使ってください、ゲッターとセッターで議論されるように。

source: Use this form to access a type as a value.
ja: 値として型にアクセスするために、この形式を使ってください。

source: Use three double quotation marks (""") for strings that take up multiple lines.
ja: 複数行にわたる文字列のために３つの二重引用符（"""）を使ってください。

source: Use variables only for storing values that need to be able to change.
ja: 変更できる必要がある値を保存するためにだけ、変数を使ってください。

source: Using try? lets you write concise error handling code when you want to handle all errors in the same way.
ja: try?を使うことで、あなたに簡潔なエラー処理コードを書くことを可能にするのは、あなたがすべてのエラーを同じやり方で取り扱いたい時です。

source: Using ARC in Swift is very similar to the approach described in Transitioning to ARC Release Notes [https://developer.apple.com/library/content/releasenotes/ObjectiveC/RN-TransitioningToARC/Introduction/Introduction.html] for using ARC with Objective-C.
ja: スウィフトでのARCの使用は、Objective-CでARCを使うためのTransitioning to ARC Release Notes [https://developer.apple.com/library/content/releasenotes/ObjectiveC/RN-TransitioningToARC/Introduction/Introduction.html]で記述される取り組みに非常に似ています。

source: Using Function Types
ja: 関数型を使う

source: Using a guard statement for requirements improves the readability of your code, compared to doing the same check with an if statement.
ja: guard文を必要条件に対して使うことは、あなたのコードの可読性を同じ検査確認をif文を使って実行するのと比べて向上します。

source: Using a Protocol in Its Associated Type’s Constraints
ja: あるプロトコルをそれの関連型のもつ制約において使用する

source: Using a generic where clause lets you add a new requirement to the extension, so that the extension adds the isTop(_:) method only when the items in the stack are equatable.
ja: 総称体where節を使うことは、あなたに新しい要件をその拡張に追加させます、それで拡張はisTop(_:)メソッドをスタックの中の項目が同等評価可能なものである時のみ加えます。

source: Using a protocol as a type is sometimes called an existential type, which comes from the phrase “there exists a type T such that T conforms to the protocol”.
ja: プロトコルを型として使うことは、ときどき存在型と呼ばれます、それは語句 “そこに型Tが存在する、そのようなTはそのプロトコルに準拠する” から来ています。

source: Using a protocol type as the return type for a function gives you the flexibility to return any type that conforms to the protocol.
ja: プロトコル型を戻り型として関数に使うことは、あなたに、そのプロトコルに準拠するどんな型でも返す柔軟性を与えます。

source: Using assertions and preconditions isn’t a substitute for designing your code in such a way that invalid conditions are unlikely to arise.
ja: 表明と前提条件を使用することは、無効な条件が思いもよらず起こるようなあなたのコードの設計に対する代役ではありません。

source: Using explicitly sized types in these situations helps to catch any accidental value overflows and implicitly documents the nature of the data being used.
ja: これらの状況において明示的に大きさを設定された型を使うことは、偶発的な何らかの値のオーバフローを捕えることや、使われているデータの性質を暗黙的に記録することの手助けになります。

source: Using optionals is similar to using nil with pointers in Objective-C, but they work for any type, not just classes.
ja: オプショナルの使用は、Objective-Cのポインターでnilを使うことに似ています、しかしそれは、ただクラスだけでなく、どんな型のためにでも働きます。

source: Using the ! operator to unwrap an optional that has a value of nil results in a runtime error.
ja: !演算子を使ってnilの値を持つあるオプショナルをアンラップすることは、実行時エラーの結果になります。

source: Using the gameLoop label makes it clear which control statement should be terminated.
ja: gameLoopラベルを使用することは、どの制御文が終了されなければならないかを明確にします。
